tap "daipeihust/tap"
tap "felixkratz/formulae"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"
tap "laishulu/homebrew"
tap "localsend/localsend"
tap "mihomo-party-org/mihomo-party"
tap "nikitabobko/tap"
brew "bat"
brew "node"
brew "bitwarden-cli"
brew "chezmoi"
brew "corepack"
brew "eza"
brew "fd"
brew "fzf"
brew "gh"
brew "git"
brew "git-delta"
brew "jq"
brew "micromamba"
brew "mihomo"
brew "mtr"
brew "rclone"
brew "ripgrep"
brew "tree"
brew "uv"
brew "zoxide"
brew "felixkratz/formulae/borders"
brew "laishulu/homebrew/macism"
cask "aerospace"
cask "android-platform-tools"
cask "blackhole-2ch"
cask "cheatsheet"
cask "chromedriver"
cask "cryptomator"
cask "eudic"
cask "firefox"
cask "font-jetbrains-mono"
cask "font-jetbrains-mono-nerd-font"
cask "font-meslo-lg-nerd-font"
cask "github"
cask "google-chrome"
cask "hammerspoon"
cask "hiddenbar"
cask "itsycal"
cask "localsend"
cask "macfuse"
cask "monitorcontrol"
cask "mos"
cask "pycharm"
cask "qbittorrent"
cask "shottr"
cask "termius"
cask "thunderbird"
cask "visual-studio-code"
cask "webstorm"
cask "wetype"
cask "wezterm@nightly"
vscode "af4jm.vscode-m3u"
vscode "ahmadalli.vscode-nginx-conf"
vscode "alanmbarr.quotify"
vscode "alefragnani.project-manager"
vscode "aykutsarac.jsoncrack-vscode"
vscode "christian-kohler.path-intellisense"
vscode "deerawan.vscode-faker"
vscode "devzstudio.emoji-snippets"
vscode "dnicolson.binary-plist"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "formulahendry.auto-close-tag"
vscode "formulahendry.auto-rename-tag"
vscode "formulahendry.code-runner"
vscode "github.codespaces"
vscode "github.vscode-github-actions"
vscode "grapecity.gc-excelviewer"
vscode "humao.rest-client"
vscode "janisdd.vscode-edit-csv"
vscode "jock.svg"
vscode "johnpapa.vscode-peacock"
vscode "kamikillerto.vscode-colorize"
vscode "mechatroner.rainbow-csv"
vscode "ms-azuretools.vscode-containers"
vscode "ms-ceintl.vscode-language-pack-zh-hans"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode.remote-explorer"
vscode "naumovs.color-highlight"
vscode "redhat.vscode-yaml"
vscode "royaction.color-manager"
vscode "sirtori.indenticator"
vscode "streetsidesoftware.code-spell-checker"
vscode "sumneko.lua"
vscode "tamasfe.even-better-toml"
vscode "tomoki1207.pdf"
vscode "uloco.theme-bluloco-dark"
vscode "uloco.theme-bluloco-light"
vscode "usernamehw.indent-one-space"
vscode "viablelab.bracket-padder"
vscode "vscode-icons-team.vscode-icons"
vscode "vscodevim.vim"
