# --- [1. 补全与环境初始化 (绝对优先级)] ---
mattmc3/ez-compinit          # 必须第一！先定义 compdef，解决所有报错
getantidote/use-omz          # 紧跟其后，初始化 OMZ 变量环境

# --- [2. OMZ 核心库] ---
ohmyzsh/ohmyzsh path:lib     # 此时 compdef 已存在，加载这里不再报错

# --- [3. 主题] ---
romkatv/powerlevel10k

# --- [4. 其他插件] ---
ohmyzsh/ohmyzsh path:plugins/git
ohmyzsh/ohmyzsh path:plugins/sudo
ohmyzsh/ohmyzsh path:plugins/extract
ohmyzsh/ohmyzsh path:plugins/colored-man-pages
ohmyzsh/ohmyzsh path:plugins/colorize
ohmyzsh/ohmyzsh path:plugins/fzf
ohmyzsh/ohmyzsh path:plugins/docker
ohmyzsh/ohmyzsh path:plugins/docker-compose
ohmyzsh/ohmyzsh path:plugins/node
ohmyzsh/ohmyzsh path:plugins/npm
ohmyzsh/ohmyzsh path:plugins/eza

# --- [5. 三方增强] ---
zsh-users/zsh-autosuggestions
zsh-users/zsh-history-substring-search
marlonrichert/zsh-autocomplete
zsh-users/zsh-syntax-highlighting